#=======================================================================================
# TEST_01.ps1
#=======================================================================================

#------------------------------------------
# БИБЛИОТЕКИ PowerShell 
#------------------------------------------

#------------------------------------------
# БИБЛИОТЕКА LU 
#------------------------------------------
    'Args[0]='+$Args[0]
    'Args[1]='+$Args[1]
    'Args[2]='+$Args[2]
    #$PSDir = 'D:\PROJECTS\!TOOLS\TOOLS_PS1\PS1'
    $PSDir = $Args[0]
    'PSDir='+$PSDir
#------------------------------------------
    $PSScriptRoot = 'D:\PROJECTS\ЯЗЫКИ\PowerShell\ТЕСТЫ\TEST_LanguageReference'
    ."$PSScriptRoot\TEST_01_LIB.ps1"
#------------------------------------------

#beginmodule
    #===========================================
    $Dir = "D:\PROJECTS\!TOOLS\TOOLS_PS1"
    $Mask = "*.*"
    #ListDir1 ($Dir, $Mask)
    ListDir1 -ASourcePath $Dir -AMask $Mask

    ListDir2 -ASourcePath $Dir -AMask $Mask

    #===========================================
    #hello ("Вася", "Костя") # традиционный синтаксис вызова функции (неправильно)
    hello -name1 "Вася" -name2 "Костя" # вызов в стиле PowerShell (правильно)

    #===========================================
    'один', 'два', 'три' | Function_FullFormat -Param2 'четыре'

    #===========================================
#endmodule
